Revit 2027 API
ExportPatternInfo(ExportPatternInfo) Constructor
 Constructs a new copy of the input ExportPatternInfo object.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public ExportPatternInfo(
	ExportPatternInfo other
)
Public Sub New (
	other As ExportPatternInfo
)
public:
ExportPatternInfo(
	ExportPatternInfo^ other
)
new :
        other : ExportPatternInfo -> ExportPatternInfo
Parameters
other ExportPatternInfo
Exceptions
Exception | Condition
ArgumentNullException |  A non-optional argument was null
See Also
Reference
ExportPatternInfo Class
ExportPatternInfo Overload
Autodesk.Revit.DB Namespace